---
kind: method
id: M:Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity.#ctor(Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity)
source: html/314b05dd-5086-1b1c-156b-dd22e218d9be.htm
---
# Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity.#ctor Method

Creates a copy of the given initial illuminance intensity object

## Syntax (C#)
```csharp
public InitialIlluminanceIntensity(
	InitialIlluminanceIntensity other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null